---
kind: property
id: P:Autodesk.Revit.DB.Visual.Ceramic.CeramicBump
source: html/84d6967a-63b0-008c-9f03-4ebbcc92e115.htm
---
# Autodesk.Revit.DB.Visual.Ceramic.CeramicBump Property

The property labeled "Type" from the "Ceramic" schema.

## Syntax (C#)
```csharp
public static string CeramicBump { get; }
```

## Remarks
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "CeramicBumpType".